<template>
    <div class="contents">
        <h1>关于Yolov10</h1>
        <div class="manual">
            <h3>Yolov10</h3>
            <p>YOLOv10 是清华大学研究人员在 UltralyticsPython
                清华大学的研究人员在 YOLOv10软件包的基础上,引入了一种新的实时目标检测方法,解决了YOLO
                以前版本在后处理和模型架构方面的不足。通过消除非最大抑制(NMS)和优化各种模型组件，
                YOLOv10 在显著降低计算开销的同时实现了最先进的性能。大量实验证明,YOLOv10
                在多个模型尺度上实现了卓越的精度-延迟权衡。
            </p>
            <p>YOLOv10 的结构建立在以前 YOLO 模型的基础上，同时引入了几项关键创新。模型架构由以下部分组成:</p>
            <li>主干网 YOLOv10 中的主干网负责特征提取，它使用了增强版的 CSPNet(跨阶段部分网络),以改善梯度流并减少计算冗余</li>
            <li>特征增强层(Neck): 特征增强层(Neck)用于聚合不同尺度的特征并将其传递到头部。它包括 PAN (路径聚合网络)层，用于有效的多尺度特征融合。</li>
            <li>一对多头:在训练过程中为每个对象生成多个预测,以提供丰富的监督信号并提高学习准确性。</li>
            <li>一对一磁头:在推理过程中为每个对象生成一个最佳预测,无需 NMS,从而减少延迟并提高效率。</li>
            <h3>方法</h3>
            <p>YOLOv10 采用双重标签分配，在训练过程中将一对多和一对一策略结合起来，
                以确保丰富的监督和高效的端到端部署。一致匹配度量使两种策略之间的监督保持一致,从而提高了推理过程中的预测质量。
            </p>
            <h4>效率提高</h4>
            <li>轻量级分类头: 通过使用深度可分离卷积,减少分类头的计算开销。</li>
            <li>空间信道解耦向下采样: 将空间缩减与信道调制解耦,最大限度地减少信息损失和计算成本。</li>
            <li>梯级引导程序块设计: 根据固有阶段冗余调整模块设计,确保参数的最佳利用。</li>
            <h4>精度提高</h4>
            <li>大核卷积扩大感受野,增强特征提取能力。</li>
            <li>部分自我关注(PSA): 纳入自我关注模块,以最小的开销改进全局表征学习。</li>
        </div>
    </div>
</template>

<script setup>

</script>

<style scoped>
h1 {
    text-align: center;
}

p {
    color: green;
}

.contents {
    height: 100vh;
}

.manual {
    width: 80%;
    padding: 20px 40px;
}
</style>